web server working
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.web.google_compute_instance.sandy-web will be created
  + resource "google_compute_instance" "sandy-web" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + hostname                = "sandy-linux.ellingson-mineral.com"
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "n1-standard-1"
      + metadata                = {
          + "block-project-ssh-keys" = "false"
          + "serial-port-enable"     = "true"
          + "ssh-keys"               = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCu+5vKjTtTWZwlDlm7AlmQdWKujHq7cWnoeJZa/sUGNj+rg8d+SfJZCF+cSuOEFxqJ6wVbX5WSAvB0MNETtncVsC6NvKNSGFsc8vIrIas5cQtyk8frp6SA9aJ/M90p2ekYwPVhqshGCLiRZ1enbm+8uvpGZkWW/g7eQV8HbxFnFCsdf9JZzHcnXWOD8tkRO9r/uuIX31BmVxEG2YE8IPC3Xq18hGglLsi0vOGdBicfOGGc/DRsw6wxXSjXF66nJAxmKZgg4lWzNIe8MkEJthI9cWPsTWcJC3XPpRuKQY6crofZa+atwkymhYJ/MUIJW4172cWLpbA1+4dvSFKSUpyo/Qs+0Zpft8vVvceaDhOsNCpzKk/qINZ3Z+Q/B4I9Ribw83K3FwfAlr6t35Z4j7cCw3VrlJtyVHrwUnVwkCNuw2zcWISfXSnCCFyVgxiJltnqk6CBOUfk6P3qIXqvQqQqp3cB1SiimVtSN5bzITiNnAdySnOUYJIsmMxkPH0Qua8cOQNNs2Ns9zAjgilTZtzG0siJtWmHJrg8+3jMG5mwzOvIgT3DadAx5ao1/+8ak4gBfoqSrLSJXPwW8Myl/I3/uxVkbxb4+jjJwnxKsbGS5LnfVGSvqEFXgtGYfNz79emdIWf3Tbh6Lv9+3Rrt9maCPg3/i5QtWBpaflI2RxurbQ== fdiaz@paloaltonetworks.com"
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt-get update; sudo apt-get install -yq build-essential apache2"
      + min_cpu_platform        = (known after apply)
      + name                    = "sandy-linux"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "http",
          + "ssh",
        ]
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/secops-iac-ctf-000378/global/images/secops-ctf-attacker-ubuntu-18"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "web"
          + network_ip         = "10.10.100.13"
          + subnetwork         = "web-subnet"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: franklin.out

To perform exactly these actions, run the following command to apply:
    terraform apply "franklin.out"

fdiaz at REMMAC11ELVDT ~ 🍻  terraform apply "franklin.out"                                        web_server
module.web.google_compute_instance.sandy-web: Creating...
module.web.google_compute_instance.sandy-web: Still creating... [10s elapsed]
module.web.google_compute_instance.sandy-web: Still creating... [20s elapsed]
module.web.google_compute_instance.sandy-web: Creation complete after 24s [id=projects/secops-iac-ctf-000378/zones/us-central1-a/instances/sandy-linux]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
fdiaz at REMMAC11ELVDT ~ 🍻 
```